Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz2051ca90176.h
#define PIN_PC04J_GCLK_spi_ixs_mclk0               _UINT32_(68)
#define MUX_PC04J_GCLK_spi_ixs_mclk0               _UINT32_(9) 
#define PINMUX_PC04J_GCLK_spi_ixs_mclk0            ((PIN_PC04J_GCLK_spi_ixs_mclk0 << 16) | MUX_PC04J_GCLK_spi_ixs_mclk0)
#define PORT_PC04J_GCLK_spi_ixs_mclk0              (_UINT32_(1) << 4)

#define PIN_PD06J_GCLK_spi_ixs_mclk0               _UINT32_(102)
#define MUX_PD06J_GCLK_spi_ixs_mclk0               _UINT32_(9) 
#define PINMUX_PD06J_GCLK_spi_ixs_mclk0            ((PIN_PD06J_GCLK_spi_ixs_mclk0 << 16) | MUX_PD06J_GCLK_spi_ixs_mclk0)
#define PORT_PD06J_GCLK_spi_ixs_mclk0              (_UINT32_(1) << 6)

#define PIN_PA31J_GCLK_spi_ixs_mclk1               _UINT32_(31)
#define MUX_PA31J_GCLK_spi_ixs_mclk1               _UINT32_(9) 
#define PINMUX_PA31J_GCLK_spi_ixs_mclk1            ((PIN_PA31J_GCLK_spi_ixs_mclk1 << 16) | MUX_PA31J_GCLK_spi_ixs_mclk1)
#define PORT_PA31J_GCLK_spi_ixs_mclk1              (_UINT32_(1) << 31)

/* ========== PORT definition for MLB peripheral ========== */
#define PIN_PD07G_MLB_MLBC                         _UINT32_(103)
#define MUX_PD07G_MLB_MLBC                         _UINT32_(6) 
#define PINMUX_PD07G_MLB_MLBC                      ((PIN_PD07G_MLB_MLBC << 16) | MUX_PD07G_MLB_MLBC)
#define PORT_PD07G_MLB_MLBC                        (_UINT32_(1) << 7)

#define PIN_PD09G_MLB_MLBD                         _UINT32_(105)
#define MUX_PD09G_MLB_MLBD                         _UINT32_(6) 
#define PINMUX_PD09G_MLB_MLBD                      ((PIN_PD09G_MLB_MLBD << 16) | MUX_PD09G_MLB_MLBD)
#define PORT_PD09G_MLB_MLBD                        (_UINT32_(1) << 9)

#define PIN_PD08G_MLB_MLBS                         _UINT32_(104)
#define MUX_PD08G_MLB_MLBS                         _UINT32_(6) 
#define PINMUX_PD08G_MLB_MLBS                      ((PIN_PD08G_MLB_MLBS << 16) | MUX_PD08G_MLB_MLBS)
#define PORT_PD08G_MLB_MLBS                        (_UINT32_(1) << 8)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PB17P_PTC_DRV0                         _UINT32_(49)
#define MUX_PB17P_PTC_DRV0                         _UINT32_(15)
#define PINMUX_PB17P_PTC_DRV0                      ((PIN_PB17P_PTC_DRV0 << 16) | MUX_PB17P_PTC_DRV0)
#define PORT_PB17P_PTC_DRV0                        (_UINT32_(1) << 17)

#define PIN_PB16P_PTC_DRV1                         _UINT32_(48)
#define MUX_PB16P_PTC_DRV1                         _UINT32_(15)
#define PINMUX_PB16P_PTC_DRV1                      ((PIN_PB16P_PTC_DRV1 << 16) | MUX_PB16P_PTC_DRV1)
#define PORT_PB16P_PTC_DRV1                        (_UINT32_(1) << 16)

#define PIN_PB15P_PTC_DRV2                         _UINT32_(47)
#define MUX_PB15P_PTC_DRV2                         _UINT32_(15)
#define PINMUX_PB15P_PTC_DRV2                      ((PIN_PB15P_PTC_DRV2 << 16) | MUX_PB15P_PTC_DRV2)
#define PORT_PB15P_PTC_DRV2                        (_UINT32_(1) << 15)

#define PIN_PB14P_PTC_DRV3                         _UINT32_(46)
#define MUX_PB14P_PTC_DRV3                         _UINT32_(15)
#define PINMUX_PB14P_PTC_DRV3                      ((PIN_PB14P_PTC_DRV3 << 16) | MUX_PB14P_PTC_DRV3)
#define PORT_PB14P_PTC_DRV3                        (_UINT32_(1) << 14)

#define PIN_PB13P_PTC_DRV4                         _UINT32_(45)
#define MUX_PB13P_PTC_DRV4                         _UINT32_(15)
#define PINMUX_PB13P_PTC_DRV4                      ((PIN_PB13P_PTC_DRV4 << 16) | MUX_PB13P_PTC_DRV4)
#define PORT_PB13P_PTC_DRV4                        (_UINT32_(1) << 13)

#define PIN_PB12P_PTC_DRV5                         _UINT32_(44)
#define MUX_PB12P_PTC_DRV5                         _UINT32_(15)
#define PINMUX_PB12P_PTC_DRV5                      ((PIN_PB12P_PTC_DRV5 << 16) | MUX_PB12P_PTC_DRV5)
#define PORT_PB12P_PTC_DRV5                        (_UINT32_(1) << 12)

#define PIN_PB11P_PTC_DRV6                         _UINT32_(43)
#define MUX_PB11P_PTC_DRV6                         _UINT32_(15)
#define PINMUX_PB11P_PTC_DRV6                      ((PIN_PB11P_PTC_DRV6 << 16) | MUX_PB11P_PTC_DRV6)
#define PORT_PB11P_PTC_DRV6                        (_UINT32_(1) << 11)

#define PIN_PB10P_PTC_DRV7                         _UINT32_(42)
#define MUX_PB10P_PTC_DRV7                         _UINT32_(15)
#define PINMUX_PB10P_PTC_DRV7                      ((PIN_PB10P_PTC_DRV7 << 16) | MUX_PB10P_PTC_DRV7)
#define PORT_PB10P_PTC_DRV7                        (_UINT32_(1) << 10)

#define PIN_PB09P_PTC_DRV8                         _UINT32_(41)
#define MUX_PB09P_PTC_DRV8                         _UINT32_(15)
#define PINMUX_PB09P_PTC_DRV8                      ((PIN_PB09P_PTC_DRV8 << 16) | MUX_PB09P_PTC_DRV8)
#define PORT_PB09P_PTC_DRV8                        (_UINT32_(1) << 9)

#define PIN_PB08P_PTC_DRV9                         _UINT32_(40)
#define MUX_PB08P_PTC_DRV9                         _UINT32_(15)
#define PINMUX_PB08P_PTC_DRV9                      ((PIN_PB08P_PTC_DRV9 << 16) | MUX_PB08P_PTC_DRV9)
#define PORT_PB08P_PTC_DRV9                        (_UINT32_(1) << 8)

#define PIN_PB07P_PTC_DRV10                        _UINT32_(39)
#define MUX_PB07P_PTC_DRV10                        _UINT32_(15)
#define PINMUX_PB07P_PTC_DRV10                     ((PIN_PB07P_PTC_DRV10 << 16) | MUX_PB07P_PTC_DRV10)
#define PORT_PB07P_PTC_DRV10                       (_UINT32_(1) << 7)

#define PIN_PB06P_PTC_DRV11                        _UINT32_(38)
#define MUX_PB06P_PTC_DRV11                        _UINT32_(15)
#define PINMUX_PB06P_PTC_DRV11                     ((PIN_PB06P_PTC_DRV11 << 16) | MUX_PB06P_PTC_DRV11)
#define PORT_PB06P_PTC_DRV11                       (_UINT32_(1) << 6)

#define PIN_PB26P_PTC_DRV12                        _UINT32_(58)
#define MUX_PB26P_PTC_DRV12                        _UINT32_(15)
#define PINMUX_PB26P_PTC_DRV12                     ((PIN_PB26P_PTC_DRV12 << 16) | MUX_PB26P_PTC_DRV12)
#define PORT_PB26P_PTC_DRV12                       (_UINT32_(1) << 26)

#define PIN_PB25P_PTC_DRV13                        _UINT32_(57)
#define MUX_PB25P_PTC_DRV13                        _UINT32_(15)
#define PINMUX_PB25P_PTC_DRV13                     ((PIN_PB25P_PTC_DRV13 << 16) | MUX_PB25P_PTC_DRV13)
#define PORT_PB25P_PTC_DRV13                       (_UINT32_(1) << 25)

#define PIN_PB24P_PTC_DRV14                        _UINT32_(56)
#define MUX_PB24P_PTC_DRV14                        _UINT32_(15)
#define PINMUX_PB24P_PTC_DRV14                     ((PIN_PB24P_PTC_DRV14 << 16) | MUX_PB24P_PTC_DRV14)
#define PORT_PB24P_PTC_DRV14                       (_UINT32_(1) << 24)

#define PIN_PB23P_PTC_DRV15                        _UINT32_(55)
#define MUX_PB23P_PTC_DRV15                        _UINT32_(15)
#define PINMUX_PB23P_PTC_DRV15                     ((PIN_PB23P_PTC_DRV15 << 16) | MUX_PB23P_PTC_DRV15)
#define PORT_PB23P_PTC_DRV15                       (_UINT32_(1) << 23)

#define PIN_PB22P_PTC_DRV16                        _UINT32_(54)
#define MUX_PB22P_PTC_DRV16                        _UINT32_(15)
#define PINMUX_PB22P_PTC_DRV16                     ((PIN_PB22P_PTC_DRV16 << 16) | MUX_PB22P_PTC_DRV16)
#define PORT_PB22P_PTC_DRV16                       (_UINT32_(1) << 22)

#define PIN_PB21P_PTC_DRV17                        _UINT32_(53)
#define MUX_PB21P_PTC_DRV17                        _UINT32_(15)
#define PINMUX_PB21P_PTC_DRV17                     ((PIN_PB21P_PTC_DRV17 << 16) | MUX_PB21P_PTC_DRV17)
#define PORT_PB21P_PTC_DRV17                       (_UINT32_(1) << 21)

#define PIN_PB31P_PTC_DRV18                        _UINT32_(63)
#define MUX_PB31P_PTC_DRV18                        _UINT32_(15)
#define PINMUX_PB31P_PTC_DRV18                     ((PIN_PB31P_PTC_DRV18 << 16) | MUX_PB31P_PTC_DRV18)
#define PORT_PB31P_PTC_DRV18                       (_UINT32_(1) << 31)

#define PIN_PB30P_PTC_DRV19                        _UINT32_(62)
#define MUX_PB30P_PTC_DRV19                        _UINT32_(15)
#define PINMUX_PB30P_PTC_DRV19                     ((PIN_PB30P_PTC_DRV19 << 16) | MUX_PB30P_PTC_DRV19)
#define PORT_PB30P_PTC_DRV19                       (_UINT32_(1) << 30)

